#include<stdio.h>
int main(void) {
	int a, b, c, d, e, f, g, h;
	for (int i = 10000; i < 100000; i++) {
		a = i / 10000;

		b = i - a * 10000;
		c = i / 1000;
		d = i - c * 1000;
		e = i / 100;
		f = i - e * 100;
		g = i / 10;
		h = i - g * 10;
		if (a * b + c * d + e * f + g * h == i) {
			printf("%d ", i);
		}

	}
	return 0;
}
//把任意的数字，从中间拆分成两个数字，比如1461 可以拆分成（1和461）, （14和61）, （146和1), 如果所有拆分后的乘积之和等于自身，则是一个Lily Number。
//
//例如：
//
//655 = 6 * 55 + 65 * 5
//
//1461 = 1 * 461 + 14 * 61 + 146 * 1
//
//求出 5位数中的所有 Lily Number。